int numA = 3;
// определили первую переменную
// int - тип данных для целых чисел
// numA - Наименование переменных допускатеся БОЛЬШИХ и маленьких латинских букв
// цифры можно использовать, но только в конце имени
// _ подчеркивание неприемлимо

int numB = 5;
// ввели вторую переменную

Console.WriteLine(numA + numB);
// вывели на экран сумму первой и второй переменной


int numC = 31;
int numD = 5;
int result = numC + numD;
// ввели промежуточную переменную, в которой считается сумма двух переменных

Console.WriteLine(result);
// вывели на  экран результат